computational-linguistics/nlp/paninian_parser.tex
% Created 2019-01-01 Tue 23:13
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Atreyee Ghosal}
\date{\today}
\title{NLP: A Paninian Perspective - Chapter 6}
\hypersetup{
 pdfauthor={Atreyee Ghosal},
 pdftitle={NLP: A Paninian Perspective - Chapter 6},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Constraints}
\label{sec:org1b194a5}

\subsection{Ambiguous Sentence}
\label{sec:org185cb66}

Having several graphs that satisfy the given constraints.

\subsection{Ill-Formed/Ungrammatical Sentence}
\label{sec:org8a25d96}

Having no parse graph that satisfies the given constraints.

\section{Paninian Grammar and Dependency Grammars}
\label{sec:org430d446}

\subsection{Similarity}
\label{sec:orgaa324b1}

Both make use of constraint graphs.

\subsection{Differences}
\label{sec:org2638623}

\begin{itemize}
\item Uses an established set of kaaraka relations, instead of dependency relations
\item Constituents in Paninian parsers are restricted enough that producing their parse is reduced to a bipartite graph matching problem
\end{itemize}

\end{document}